In [1]:
import pandas as pd

In [3]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [4]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [6]:
# 只讀取某欄位的資料 usecols
# 方法一
ufo = pd.read_csv('http://bit.ly/uforeports', usecols = ['City', 'State'])
ufo.columns

Index(['City', 'State'], dtype='object')

In [ ]:
# 方法二
ufo = pd.read_csv('http://bit.ly/uforeports', usecols = [0, 4])

In [7]:
# 只讀取前三列資料 nrows
ufo = pd.read_csv('http://bit.ly/uforeports', nrows = 3)

In [8]:
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

- How do DataFrame and Series work with regard to selecting individual entries and iteration?

In [10]:
# 在Series做迭代
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke

In [11]:
# 在DataFrame 做迭代
# iterrows() 一列一列讀取資料
# row 為一整列
# index：幫助你定位正在處理的資料位於原資料的位置
#如果要進入這整列資料的某一格，就row[column_name] (column_name通常會是一個字串String)
for index, row in ufo.iterrows():
    print(index, row.City, row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

- What's the best way to drop every non-numeric column from a DataFrame?

In [12]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [14]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [15]:
import numpy as np
drinks.select_dtypes(include = [np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

- where we should [ ], and where not?

In [26]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [25]:
drinks.describe(include = ['object'])

       country continent
count      193       193
unique     193         6
top     Latvia    Africa
freq         1        53